ChibiOS/ChibiOS/os/hal/ports/STM32/STM32L5xx/hal_lld.h
/*
 * HSI16 related checks.
 */
#if STM32_HSI16_ENABLED
#else /* !STM32_HSI16_ENABLED */

  #if STM32_SW == STM32_SW_HSI16
    #error "HSI16 not enabled, required by STM32_SW"
  #endif

  #if (STM32_SW == STM32_SW_PLL) && (STM32_PLLSRC == STM32_PLLSRC_HSI16)
    #error "HSI16 not enabled, required by STM32_SW and STM32_PLLSRC"
  #endif

  /* MCO-related checks.*/
  #if (STM32_MCOSEL == STM32_MCOSEL_HSI16) ||                               \
      ((STM32_MCOSEL == STM32_MCOSEL_PLL) &&                                \
       (STM32_PLLSRC == STM32_PLLSRC_HSI16))
    #error "HSI16 not enabled, required by STM32_MCOSEL"
  #endif

  /* SAI1-related checks.*/
  #if STM32_SAI1SEL == STM32_SAI1SEL_HSI16
    #error "HSI16 not enabled, required by STM32_SAI1SEL"
  #endif

  #if (STM32_SAI1SEL == STM32_SAI1SEL_PLL) &&                               \
      (STM32_PLLSRC == STM32_PLLSRC_HSI16)
    #error "HSI16 not enabled, required by STM32_SAI1SEL"
  #endif

  #if (STM32_SAI1SEL == STM32_SAI1SEL_PLLSAI1) &&                           \
      (STM32_PLLSAI1SRC == STM32_PLLSAI1SRC_HSI16)
    #error "HSI16 not enabled, required by STM32_PLLSAI1SRC"
   #endif

  #if (STM32_SAI1SEL == STM32_SAI1SEL_PLLSAI2) &&                           \
      (STM32_PLLSAI2SRC == STM32_PLLSAI2SRC_HSI16)
    #error "HSI16 not enabled, required by STM32_PLLSAI2SRC"
  #endif

  /* SAI2-related checks.*/
  #if STM32_SAI2SEL == STM32_SAI12SEL_HSI16
    #error "HSI16 not enabled, required by STM32_SAI2SEL"
  #endif

  #if (STM32_SAI2SEL == STM32_SAI2SEL_PLL) &&                               \
      (STM32_PLLSRC == STM32_PLLSRC_HSI16)
    #error "HSI16 not enabled, required by STM32_SAI2SEL"
  #endif

  #if (STM32_SAI2SEL == STM32_SAI2SEL_PLLSAI1) &&                           \
      (STM32_PLLSAI1SRC == STM32_PLLSAI1SRC_HSI16)
    #error "HSI16 not enabled, required by STM32_PLLSAI1SRC"
  #endif

  #if (STM32_SAI2SEL == STM32_SAI2SEL_PLLSAI2) &&                           \
      (STM32_PLLSAI2SRC == STM32_PLLSAI2SRC_HSI16)
    #error "HSI16 not enabled, required by STM32_PLLSAI2SRC"
  #endif

  /* USART/UART-related checks.*/
  #if (STM32_USART1SEL == STM32_USART1SEL_HSI16)
    #error "HSI16 not enabled, required by STM32_USART1SEL"
  #endif
  #if (STM32_USART2SEL == STM32_USART2SEL_HSI16)
    #error "HSI16 not enabled, required by STM32_USART2SEL"
  #endif
  #if (STM32_USART3SEL == STM32_USART3SEL_HSI16)
    #error "HSI16 not enabled, required by STM32_USART3SEL"
  #endif
  #if (STM32_UART4SEL == STM32_UART4SEL_HSI16)
    #error "HSI16 not enabled, required by STM32_UART4SEL"
  #endif
  #if (STM32_UART5SEL == STM32_UART5SEL_HSI16)
    #error "HSI16 not enabled, required by STM32_UART5SEL"
  #endif
  #if (STM32_LPUART1SEL == STM32_LPUART1SEL_HSI16)
    #error "HSI16 not enabled, required by STM32_LPUART1SEL"
  #endif

  /* I2C-related checks.*/
  #if (STM32_I2C1SEL == STM32_I2C1SEL_HSI16)
    #error "HSI16 not enabled, required by I2C1SEL"
  #endif
  #if (STM32_I2C2SEL == STM32_I2C2SEL_HSI16)
    #error "HSI16 not enabled, required by I2C2SEL"
  #endif
  #if (STM32_I2C3SEL == STM32_I2C3SEL_HSI16)
    #error "HSI16 not enabled, required by I2C3SEL"
  #endif
  #if (STM32_I2C4SEL == STM32_I2C4SEL_HSI16)
    #error "HSI16 not enabled, required by I2C4SEL"
  #endif

  /* LPTIM-related checks.*/
  #if (STM32_LPTIM1SEL == STM32_LPTIM1SEL_HSI16)
    #error "HSI16 not enabled, required by LPTIM1SEL"
  #endif
  #if (STM32_LPTIM2SEL == STM32_LPTIM2SEL_HSI16)
    #error "HSI16 not enabled, required by LPTIM2SEL"
  #endif

  #if (STM32_STOPWUCK == STM32_STOPWUCK_HSI16)
    #error "HSI16 not enabled, required by STM32_STOPWUCK"
  #endif

#endif /* !STM32_HSI16_ENABLED */

#if STM32_HSI48_ENABLED
#else /* !STM32_HSI48_ENABLED */

  #if STM32_MCOSEL == STM32_MCOSEL_HSI48
    #error "HSI48 not enabled, required by STM32_MCOSEL"
  #endif

  #if STM32_CLK48SEL == STM32_CLK48SEL_HSI48
    #error "HSI48 not enabled, required by STM32_CLK48SEL"
  #endif

#endif /* !STM32_HSI48_ENABLED */

/*
 * HSE related checks.
 */
#if STM32_HSE_ENABLED

  #if STM32_HSECLK == 0
    #error "HSE frequency not defined"
  #else /* STM32_HSECLK != 0 */
    #if defined(STM32_HSE_BYPASS)
      #if (STM32_HSECLK < STM32_HSECLK_BYP_MIN) || (STM32_HSECLK > STM32_HSECLK_BYP_MAX)
        #error "STM32_HSECLK outside acceptable range (STM32_HSECLK_BYP_MIN...STM32_HSECLK_BYP_MAX)"
      #endif
    #else /* !defined(STM32_HSE_BYPASS) */
      #if (STM32_HSECLK < STM32_HSECLK_MIN) || (STM32_HSECLK > STM32_HSECLK_MAX)
        #error "STM32_HSECLK outside acceptable range (STM32_HSECLK_MIN...STM32_HSECLK_MAX)"
      #endif
    #endif /* !defined(STM32_HSE_BYPASS) */
  #endif /* STM32_HSECLK != 0 */

#else /* !STM32_HSE_ENABLED */

  #if STM32_SW == STM32_SW_HSE
    #error "HSE not enabled, required by STM32_SW"
  #endif

  #if (STM32_SW == STM32_SW_PLL) && (STM32_PLLSRC == STM32_PLLSRC_HSE)
    #error "HSE not enabled, required by STM32_SW and STM32_PLLSRC"
  #endif

  /* MCO-related checks.*/
  #if (STM32_MCOSEL == STM32_MCOSEL_HSE) ||                                 \
      ((STM32_MCOSEL == STM32_MCOSEL_PLL) &&                                \
       (STM32_PLLSRC == STM32_PLLSRC_HSE))
    #error "HSE not enabled, required by STM32_MCOSEL"
  #endif

  /* SAI1-related checks.*/
  #if (STM32_SAI1SEL == STM32_SAI1SEL_PLL) &&                               \
      (STM32_PLLSRC == STM32_PLLSRC_HSE)
    #error "HSE not enabled, required by STM32_SAI1SEL"
  #endif

  #if (STM32_SAI1SEL == STM32_SAI1SEL_PLLSAI1) &&                           \
      (STM32_PLLSAI1SRC == STM32_PLLSAI1SRC_HSE)
    #error "HSE not enabled, required by STM32_PLLSAI1SRC"
   #endif

  #if (STM32_SAI1SEL == STM32_SAI1SEL_PLLSAI2) &&                           \
      (STM32_PLLSAI2SRC == STM32_PLLSAI2SRC_HSE)
    #error "HSE not enabled, required by STM32_PLLSAI2SRC"
  #endif

  /* SAI2-related checks.*/
  #if (STM32_SAI2SEL == STM32_SAI2SEL_PLL) &&                               \
      (STM32_PLLSRC == STM32_PLLSRC_HSE)
    #error "HSE not enabled, required by STM32_SAI2SEL"
  #endif

  #if (STM32_SAI2SEL == STM32_SAI2SEL_PLLSAI1) &&                           \
      (STM32_PLLSAI1SRC == STM32_PLLSAI1SRC_HSE)
    #error "HSE not enabled, required by STM32_PLLSAI1SRC"
  #endif

